{
  "criteria": {
    "A1": {
      "band": 3,
      "evidence": "The Learning Objectives are clearly stated with measurable verbs (Recall, Apply, Analyze). The outcomes use SMARTIE language.",
      "notes": ""
    },
    "A2": {
      "band": 4,
      "evidence": "Each key ILO has at least one learning activity and one assessment task at the same cognitive level. For example, 'Recall key concepts and terminology related to artificial intelligence (AI)' is assessed through an Exit Ticket and a Quick Concept Quiz.",
      "notes": ""
    },
    "A3": {
      "band": 2,
      "evidence": "The lesson plan has some sequencing but with minor issues. The steps are present but uneven, e.g., the Direct Instruction Strategies section jumps between Explicit Instruction and Demonstration without clear transitions.",
      "notes": ""
    },
    "B1": {
      "band": 3,
      "evidence": "The lesson seed aims for a mix of Constructive/Interactive modes (e.g., Think-Pair-Share, Case Study Analysis) with some Interactive activities (e.g., Hands-on Experiment).",
      "notes": ""
    },
    "B2": {
      "band": 3,
      "evidence": "The lesson includes generative prompts and tasks that require explain/justify/compare/predict. For example, the Discussion Prompt asks students to share their prior experiences with AI.",
      "notes": ""
    },
    "B3": {
      "band": 2,
      "evidence": "The lesson plan includes some all-student response routines (e.g., Interactive Class Poll) and group work with prompts. However, the interdependence of groups is weak.",
      "notes": ""
    },
    "C1": {
      "band": 3,
      "evidence": "There are distinct retrieval episodes (e.g., Exit Tickets, Quick Concept Quiz) with high-effort formats (short-answer, no-notes problems).",
      "notes": ""
    },
    "C2": {
      "band": 4,
      "evidence": "The lesson plan includes aligned exit tickets/mini-quizzes/oral checks with immediate use and task-focused feedback time. For example, the Exit Tickets are used to assess understanding of AI literacy.",
      "notes": ""
    },
    "C3": {
      "band": 2,
      "evidence": "There is some spacing between retrievals (e.g., Exit Tickets and Quick Concept Quiz), but no delayed cumulative checks or later quizzes that include prior content.",
      "notes": ""
    },
    "D1": {
      "band": 3,
      "evidence": "The lesson plan includes full worked examples or think-alouds (e.g., the mini-lecture introducing key terms) and a timed, scaffolded 'we do' phase (e.g., Guided Practice Worksheet).",
      "notes": ""
    },
    "D2": {
      "band": 3,
      "evidence": "The lesson plan includes sentence stems, checklists, partial solutions, compare-contrast tables (e.g., the Guided Practice Worksheet), and an explicit plan to fade supports.",
      "notes": ""
    },
    "D3": {
      "band": 2,
      "evidence": "The independent tasks mirror models (e.g., Hands-on Experiment), but there is no circulation/monitoring plan with error interception.",
      "notes": ""
    },
    "E1": {
      "band": 3,
      "evidence": "The lesson plan includes a simple→complex progression and isolate hard elements before integration. For example, the Direct Instruction Strategies section starts with Explicit Instruction and then moves to Demonstration.",
      "notes": ""
    },
    "E2": {
      "band": 2,
      "evidence": "There is some integrated materials (e.g., the graphic representation of AI applications in everyday life), but no consistent integration or concise on-screen text.",
      "notes": ""
    },
    "E3": {
      "band": 1,
      "evidence": "The lesson plan does not include early probes, novices getting more guidance, supports fading, or quick effort/load checks to trigger specific adjustments.",
      "notes": ""
    },
    "F1": {
      "band": 2,
      "evidence": "There are some multiple means of representation/action/engagement (e.g., graphic representation of AI applications in everyday life), but no clear instructions or proactive accommodations.",
      "notes": ""
    },
    "F2": {
      "band": 3,
      "evidence": "The lesson plan includes error-friendly norms, progress tracking, and structured reflection linked to ILOs. For example, the Discussion Prompt encourages students to share their prior experiences with AI.",
      "notes": ""
    }
  },
  "global_notes": ""
}